"""Задача 10: минимальное количество монет, которые нужно перевернуть"""
# n = int(input('Введите число'))
# x = 1
# i = 1
# while i ** 2 <= n:
#     x = i ** 2
#     print(x)
#     i += 1



"""Задача 12: два натуральных числа """
# s = int(input('Введите сумму двух чисел'))
# p = int(input('Введите произведение двух чисел'))
# for x in range(0, 1000):
#     for y in range(0, 1000):
#         if ((x + y == s) and (x * y == p)):
#             print(f'{x}, {y}')
#             break




"""Задача 14: все целые степени двойки"""
# n = int(input('Введите число'))
# x = 0
# for i in range(0, n ):
#     x = 2 ** i
#     if x < n:
#         i += 1
#         print(x)
        

