# Напишите программу, которая принимает на вход координаты двух точек и 
# находит расстояние между ними в 2D пространстве.
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

# x1 = int(input('Введите значение x1: '))
# y1 = int(input('Введите значение y1: '))
# x2 = int(input('Введите значение x2: '))
# y2 = int(input('Введите значение y2: '))
# a = ((x2-x1)**2+(y2-y1)**2)
# import math
# sqrt = math.sqrt(a)
# print(sqrt)


# Дописать данные
# with open('file.txt', 'a') as data:
#    data.write('Line 112\n')
#    data.write('Line 122\n') 


# Чтение данных из файла
# path = 'file.txt'
# data = open(path, 'r')
# for line in data:
#     print(line)
# data.close()

# exit()


# Функции
# def concatenation(*params):
#     res = 0
#     for item in params:
#         res += item
#     return res
# print(concatenation(1, 2, 3, 4))

# Кортежи
# a = (3, 1)
# # print(a)
# # print(a[0])
# for item in a:
#     print(item)

# # Нахождение числа в строке
# my_list = ['sgfdqy12gds', 'hsgd567', 'df23cbjd']
# print(my_list)
# search = input('Введите искомое число: ')
# for item in my_list:
#     if search in item:
#         print(f'число {search} входит в заданный список')
#         break
# else:
#     print(f'число {search} не входит в заданный список')

# colors = ['red', 'green', 'blue1212']
# data = open('file.txt', 'a')
# # data.writelines(colors)
# data.write('LINE 12\n')
# data.write('LINE 13\n')
# data.close()